package p2267

type Node struct {
	high, low uint64
}

// Принимаем указатель, как и ресивер, соблюдая конвенцию
func (n *Node) move(a *Node, ch byte) {
	if a.low == 0 && a.high == 0 {
		return // Если путь до этой клетки невалиден, пропускаем
	}

	if ch == '(' {
		// Увеличиваем баланс (сдвиг влево на 1)
		n.high |= (a.high << 1) | (a.low >> 63)
		n.low |= (a.low << 1)
	} else {
		// Уменьшаем баланс (сдвиг вправо на 1)
		// Если баланс был 0, то младший бит просто "выпадет",
		// и невалидный отрицательный баланс исчезнет сам собой!
		n.low |= (a.low >> 1) | ((a.high & 1) << 63)
		n.high |= (a.high >> 1)
	}
}

func hasValidPath(grid [][]byte) bool {
	n, m := len(grid), len(grid[0])

	// Если длина пути нечетная, свести баланс к 0 невозможно.
	// Очевидные фейлы на старте и финише тоже отсекаем.
	if (n+m)%2 == 0 || grid[0][0] == ')' || grid[n-1][m-1] == '(' {
		return false
	}

	dp := make([][]Node, n)
	for i := range dp {
		dp[i] = make([]Node, m)
	}

	// Задаем корректный старт.
	// Мы стоим на (0,0) и там '(', значит текущий баланс равен 1 (устанавливаем 1-й бит).
	dp[0][0].low = 2

	for i := 0; i < n; i++ {
		for j := 0; j < m; j++ {
			// (0,0) уже обработана, пропускаем
			if i == 0 && j == 0 {
				continue
			}

			// Собираем валидные пути сверху
			if i > 0 {
				dp[i][j].move(&dp[i-1][j], grid[i][j])
			}
			// Собираем валидные пути слева
			if j > 0 {
				dp[i][j].move(&dp[i][j-1], grid[i][j])
			}
		}
	}

	// В конце нас устроит только баланс равный 0.
	// Это значит, что должен быть установлен 0-й бит (dp...low & 1).
	return dp[n-1][m-1].low&1 != 0
}
