package p0190

import "math/bits"

/*
нужно перевернуть строку из 8 символов: ABCDEFGH.
Сначала меняем местами соседей: BA DC FE HG.
Потом меняем пары: DCBA HGFE.
Потом четверки: HGFEDCBA.
*/

const (
	mask1 = 0b0101_0101_0101_0101_0101_0101_0101_0101
	mask2 = 0b0011_0011_0011_0011_0011_0011_0011_0011
	mask4 = 0b0000_1111_0000_1111_0000_1111_0000_1111
	mask8 = 0b0000_0000_1111_1111_0000_0000_1111_1111
)

func reverseBits(n int) int {
	x := uint32(n)
	x = ((x >> 1) & mask1) | ((x & mask1) << 1)
	x = ((x >> 2) & mask2) | ((x & mask2) << 2)
	x = ((x >> 4) & mask4) | ((x & mask4) << 4)
	x = ((x >> 8) & mask8) | ((x & mask8) << 8)
	x = (x >> 16) | (x << 16) // меняем половинки
	return int(x)
}

func reverseBits2(n int) int {
	x := uint32(n)
	x = ((x >> 1) & 0b0101_0101_0101_0101_0101_0101_0101_0101) | ((x << 1) & 0b1010_1010_1010_1010_1010_1010_1010_1010)
	x = ((x >> 2) & 0b0011_0011_0011_0011_0011_0011_0011_0011) | ((x << 2) & 0b1100_1100_1100_1100_1100_1100_1100_1100)
	x = ((x >> 4) & 0b0000_1111_0000_1111_0000_1111_0000_1111) | ((x << 4) & 0b1111_0000_1111_0000_1111_0000_1111_0000)
	x = ((x >> 8) & 0b0000_0000_1111_1111_0000_0000_1111_1111) | ((x << 8) & 0b1111_1111_0000_0000_1111_1111_0000_0000)
	x = (x >> 16) | (x << 16) // меняем половинки
	return int(x)
}

func reverseBits1(n int) int {
	res := 0
	for i := 0; i < 32; i++ {
		res <<= 1
		res |= n & 1
		n >>= 1
	}
	return res
}

func reverseBits0(n int) int {
	return int(bits.Reverse32(uint32(n)))
}
